tap "asmvik/formulae"
tap "bjarneo/cliamp"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae", trusted: true
tap "franzos/tap", trusted: true
tap "modem-dev/tap"
tap "tamtom/tap"
# Official Amazon AWS command-line interface
brew "awscli"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# GitHub command-line tool
brew "gh"
# Simple terminal UI for git commands
brew "lazygit"
# AI coding agent with cross-session memory
brew "mimo-code"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Your Gateway to Embedded Software Development Excellence
brew "platformio"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Next-generation plugin manager for zsh
brew "zplug"
# Simple hotkey-daemon for macOS.
brew "asmvik/formulae/skhd", trusted: true
# A tiling window manager for macOS based on binary space partitioning.
brew "asmvik/formulae/yabai", trusted: true
# A retro terminal music player inspired by Winamp 2.x
brew "bjarneo/cliamp/cliamp", trusted: true
# A window border system for macOS
brew "felixkratz/formulae/borders", trusted: true
# Token Usage CLI for Claude Code, Codex and others
brew "franzos/tap/tku"
# Desktop-inspired terminal diff viewer for agent-authored changesets
brew "modem-dev/tap/hunk", trusted: true
# CLI for Google Play Console - manage Android apps from the terminal
brew "tamtom/tap/gplay", trusted: true
# Password manager
cask "1password@beta"
# Tools for building Android applications
cask "android-studio"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Tool to measure the computer system's performance
cask "geekbench"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Open-source keystroke visualiser
cask "keycastr"
# Voice-to-text transcription and paste tool
cask "kitlangton-hex"
# Discover, download, and run local LLMs
cask "lm-studio"
# Calendar for professionals and teams
cask "notion-calendar"
# Replacement for Docker Desktop
cask "orbstack"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "eduardoborges.draculinho"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "markis.code-coverage"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "msjsdiag.vscode-react-native"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "trentrand.git-rebase-shortcuts"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "yoavbls.pretty-ts-errors"
vscode "yokinanya.libre-gitless"
vscode "zignd.html-css-class-completion"
vscode "zitup.classnametocss"
npm "opencode-with-claude"
