tap "asmvik/formulae"
tap "FelixKratz/formulae"
tap "tamtom/tap"

brew "FelixKratz/formulae/borders", trusted: true
brew "cloudflared"
brew "cocoapods"
brew "duti"
brew "gh"
brew "lazygit"
brew "mise"
brew "platformio"
brew "rtk"
brew "starship"
brew "stow"
brew "zplug"
brew "asmvik/formulae/skhd", trusted: true
brew "asmvik/formulae/yabai", trusted: true
brew "tamtom/tap/gplay", trusted: true

cask "1password@beta"
cask "android-studio"
cask "chatgpt"
cask "chromium"
cask "claude"
cask "claude-code"
cask "codex"
cask "codex-app"
cask "docker-desktop"
cask "geekbench"
cask "ghostty"
cask "google-chrome"
cask "keycastr"
cask "kitlangton-hex"
cask "lm-studio"
cask "notion-calendar"
cask "slack"
cask "spotify"
cask "stats"
cask "vscodium@insiders"
cask "whatsapp"
